In [77]:
import pandas as pd
users_data=pd.read_csv("users.csv",index_col=0)
users_data

   user_id           name                   email      country signup_date
0        1       John Doe      john.doe@gmail.com        Kenya  2024-01-05
1        2     Jane Smith    jane_smith@yahoo.com          USA  2024-01-12
2        3     Mike Brown                     NaN           UK  2024-02-01
3        4  Alice Johnson         alice@gmail.com        Kenya  2024-02-15
4        5     Robert Lee  robert.lee@outlook.com       Canada  2024-03-01
5        6      Linda Kim     linda.kim@gmail.com  South Korea  2024-03-05
6        7   David Miller         david@gmail.com          USA  2024-03-10
7        8   Sarah Wilson         sarah@yahoo.com           UK  2024-03-15
8        9    Chris Evans         chris@gmail.com        Kenya         NaN
9       10    Emily Davis         emily@gmail.com          USA  2024-03-25

In [78]:
#find any missing values in users_data
#using True or False
users_data.isnull().any()
#we have some missing email and signup date

user_id        False
name           False
email           True
country        False
signup_date     True
dtype: bool

In [79]:
#use numeric values is 0 and 1 to check any missing values
users_data.isnull().sum()

user_id        0
name           0
email          1
country        0
signup_date    1
dtype: int64

In [80]:
#most frequent country for most uses
users_data['country'].value_counts()
#most users are from Kenya and USA

country
Kenya          3
USA            3
UK             2
Canada         1
South Korea    1
Name: count, dtype: int64

In [81]:
#get all users from Kenya
users_from_kenya=users_data[users_data['country']=='Kenya']
print("Total users from Kenya: ",len(users_from_kenya))
users_from_kenya

Total users from Kenya:  3

   user_id           name               email country signup_date
0        1       John Doe  john.doe@gmail.com   Kenya  2024-01-05
3        4  Alice Johnson     alice@gmail.com   Kenya  2024-02-15
8        9    Chris Evans     chris@gmail.com   Kenya         NaN

In [83]:
#fetch user with id of 4 from users table
#return as Dataframe ie with row and column
user_id_4=users_data.loc[[4]]
user_id_4

   user_id        name                   email country signup_date
4        5  Robert Lee  robert.lee@outlook.com  Canada  2024-03-01

In [84]:
#get orders csv file
orders_data=pd.read_csv("orders.csv",index_col=0)
orders_data

   order_id  user_id  order_date order_status
0       101        1  2024-03-01    Completed
1       102        2  2024-03-02    Completed
2       103        3  2024-03-05    Cancelled
3       104        4  2024-03-07    Completed
4       105        5  2024-03-08      Pending
5       106        1  2024-03-10    Completed
6       107        7  2024-03-12    Completed
7       108        8  2024-03-15    Completed
8       109       11  2024-03-18    Completed
9       110        9  2024-03-20    Completed

In [85]:
#get total number of orders
print("Total orders: ",len(orders_data))

Total orders:  10

In [86]:
#get frequency of order status
order_frequency=orders_data['order_status'].value_counts()
order_frequency
#most orders are completed

order_status
Completed    8
Cancelled    1
Pending      1
Name: count, dtype: int64

In [87]:
#get payments csv file data
payments_data=pd.read_csv("payments.csv",index_col=0)
payments_data

   payment_id  order_id payment_method  amount_paid payment_status
0         201       101    Credit Card        840.0        Success
1         202       102         PayPal        500.0        Success
2         203       104    Credit Card        820.0        Success
3         204       105          Mpesa         50.0         Failed
4         205       106    Credit Card        400.0        Success
5         206       108         PayPal         25.0        Success
6         207       110    Credit Card          NaN        Success

In [88]:
#combine orders and payments table based on shared order_id
orders_and_payments_table=pd.merge(
    orders_data,
    payments_data,
    on="order_id",
    how="outer")
orders_and_payments_table

,order_id,user_id,order_date,order_status,payment_id,payment_method,amount_paid,payment_status
0,101,1,2024-03-01,Completed,201.0,Credit Card,840.0,Success
1,102,2,2024-03-02,Completed,202.0,PayPal,500.0,Success
2,103,3,2024-03-05,Cancelled,NaN,NaN,NaN,NaN
3,104,4,2024-03-07,Completed,203.0,Credit Card,820.0,Success
4,105,5,2024-03-08,Pending,204.0,Mpesa,50.0,Failed
5,106,1,2024-03-10,Completed,205.0,Credit Card,400.0,Success
6,107,7,2024-03-12,Completed,NaN,NaN,NaN,NaN
7,108,8,2024-03-15,Completed,206.0,PayPal,25.0,Success
8,109,11,2024-03-18,Completed,NaN,NaN,NaN,NaN
9,110,9,2024-03-20,Completed,207.0,Credit Card,NaN,Success

In [89]:
#combine users with orders and payments table
users_orders_payments_table=pd.merge(
    users_data,
    orders_and_payments_table,
    on="user_id",
    how="outer")
#reset index
users_orders_payments_table=(
    users_orders_payments_table
    .reset_index(drop=True)
    .assign(user_id=lambda x:x.index+1)
    .set_index("user_id")
)
users_orders_payments_table

,name,email,country,signup_date,order_id,order_date,order_status,payment_id,payment_method,amount_paid,payment_status
user_id,,,,,,,,,,,
1,John Doe,john.doe@gmail.com,Kenya,2024-01-05,101.0,2024-03-01,Completed,201.0,Credit Card,840.0,Success
2,John Doe,john.doe@gmail.com,Kenya,2024-01-05,106.0,2024-03-10,Completed,205.0,Credit Card,400.0,Success
3,Jane Smith,jane_smith@yahoo.com,USA,2024-01-12,102.0,2024-03-02,Completed,202.0,PayPal,500.0,Success
4,Mike Brown,NaN,UK,2024-02-01,103.0,2024-03-05,Cancelled,NaN,NaN,NaN,NaN
5,Alice Johnson,alice@gmail.com,Kenya,2024-02-15,104.0,2024-03-07,Completed,203.0,Credit Card,820.0,Success
6,Robert Lee,robert.lee@outlook.com,Canada,2024-03-01,105.0,2024-03-08,Pending,204.0,Mpesa,50.0,Failed
7,Linda Kim,linda.kim@gmail.com,South Korea,2024-03-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,David Miller,david@gmail.com,USA,2024-03-10,107.0,2024-03-12,Completed,NaN,NaN,NaN,NaN
9,Sarah Wilson,sarah@yahoo.com,UK,2024-03-15,108.0,2024-03-15,Completed,206.0,PayPal,25.0,Success
10,Chris Evans,chris@gmail.com,Kenya,NaN,110.0,2024-03-20,Completed,207.0,Credit Card,NaN,Success
11,Emily Davis,emily@gmail.com,USA,2024-03-25,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,109.0,2024-03-18,Completed,NaN,NaN,NaN,NaN

In [76]:
#check for missing values in users_orders_payments_table
#find total count for each missing value
users_orders_payments_table.isnull().sum()

name              1
email             2
country           1
signup_date       2
order_id          2
order_date        2
order_status      2
payment_id        5
payment_method    5
amount_paid       6
payment_status    5
dtype: int64

In [90]:
#total amount paid per country
total_per_country=(
    users_orders_payments_table
    #group by country
    .groupby(["country"],as_index=False)["amount_paid"].sum()
    #sort by highest to lowest total
    .sort_values("amount_paid",ascending=False)
    .reset_index(drop=True)   
)
#let index start from 1
total_per_country.index+=1
total_per_country

       country  amount_paid
1        Kenya       2060.0
2          USA        500.0
3       Canada         50.0
4           UK         25.0
5  South Korea          0.0

In [91]:
#get amount per user
amount_per_user=(
    users_orders_payments_table
    .groupby(["name"],as_index=False)["amount_paid"].sum()
    .sort_values("amount_paid",ascending=False)
    .reset_index(drop=True)
)
#reset index
amount_per_user.index+=1
amount_per_user

             name  amount_paid
1        John Doe       1240.0
2   Alice Johnson        820.0
3      Jane Smith        500.0
4      Robert Lee         50.0
5    Sarah Wilson         25.0
6     Chris Evans          0.0
7    David Miller          0.0
8     Emily Davis          0.0
9       Linda Kim          0.0
10     Mike Brown          0.0

In [72]:
#fetch names and emails
user_info=users_data[['name','email']].copy()
#fill in empty strings with pandas missing value marker
user_info[['name','email']]=(user_info[['name','email']].replace('',pd.NA))
user_info.reset_index(drop=True)
#reset index
user_info.index+=1
user_info['name']=user_info['name'].fillna("not found")
user_info['email']=user_info['email'].fillna("Unknown")
user_info

             name                   email
1        John Doe      john.doe@gmail.com
2      Jane Smith    jane_smith@yahoo.com
3      Mike Brown                 Unknown
4   Alice Johnson         alice@gmail.com
5      Robert Lee  robert.lee@outlook.com
6       Linda Kim     linda.kim@gmail.com
7    David Miller         david@gmail.com
8    Sarah Wilson         sarah@yahoo.com
9     Chris Evans         chris@gmail.com
10    Emily Davis         emily@gmail.com

In [70]:
sales_summary=(
    users_orders_payments_table
    .groupby(["country"],as_index=False)
    .agg(total_sales=("amount_paid","sum"),average_sales=("amount_paid","mean"))
    .reset_index(drop=True)
)
#fill NaN with 0
sales_summary['average_sales']=sales_summary2['average_sales'].fillna(0)
#reset index to start from 1
sales_summary.index+=1
sales_summary

       country  total_sales  average_sales
1       Canada         50.0      50.000000
2        Kenya       2060.0     686.666667
3  South Korea          0.0       0.000000
4           UK         25.0      25.000000
5          USA        500.0     500.000000